[{
  "image": {
    "source": "HALf-of-austr-335x204.png",
    "text": "Half of older Australians live with disabilities"
  },
  "heading": "Findings Show Half Of Older Australians Live With Disabilities",
  "description": "ABS: 50.7% of Australians 65 Years+ Are Living With Disability Findings from the Australian Bureau of Statistics have discovered a rise in reported cases of seniors living with disability in Australia. Released on the 29th of April 2016, the media release from the Australian Bureau of Statistics shows a rise in the number of Australians aged 65 years and older that have […]"
}, {
  "image": {
    "source": "home-care-or-nursing-home-335x204.png",
    "text": "Home Care vs. Nursing Care"
  },
  "heading": "What Makes People Choose In-Home Care?",
  "description": "What Makes Many Australians Choose Home Care Instead Of Nursing Home Services For many individuals and families that are tasked with considering a solution to provide support for their loved one, the choice between an assisted living facility (or nursing home) versus in-home care can present itself as a crossroad. Both have their perks, but […]"
}, {
  "image": {
    "source": "in-home-respite-care-335x204.png",
    "text": "In-Home Respite Care"
  },
  "heading": "How Respite Care Can Work For You",
  "description": "How Respite Care Can Work In Your Home Respite care is an extremely invaluable service for many individuals and families who receive regular home care. Respite care works as a mediator. It lets your regular caregiver take an often much-needed break or temporary period of rest, so that they may continue to uphold the standard […]"
}, {
  "image": {
    "source": "Live-In-Home-Care-335x204.png",
    "text": "Live-In Home Care"
  },
  "heading": "Learning About Live-In Care",
  "description": "Live-In Home Care For Elderly and Disabled Individuals and Families   Live-In Care provides the ability to live safely in your own home. You or your loved one can continue to live in their own environment, where they are comfortable and have their own independence. Many prefer to pursue live-in care as an alternative to being […]"
}, {
  "image": {
    "source": "Home-care-for-domestic-couples-1-335x204.png",
    "text": "Home Care for Couples"
  },
  "heading": "Home Care for Couples",
  "description": "Elderly and Disability Home Care For Couples   At-home care for couples is a perfect solution for ensuring that live-in-couples or those in spousal relationships can continue to live together safely–while still maintaining all the freedom that comes with continuing to live in their own home.   Care for couples is delivered in a wide variety […]"
}, {
  "image": {
    "source": "templatee-3-335x204.png",
    "text": "Knowing When It’s Time To Consider Home Care"
  },
  "heading": "Knowing When It’s Time To Consider Home Care",
  "description": "How Can You Tell When Home Care Is Necessary? The first step to receiving care at your home is the realisation that you or a loved one may benefit from it. It can be difficult feeling like you need care or assistance, or to accept that a loved one might, but as we age we […]"
}]